dynamic-soap-endpoint/src/main/resources/Goodbye.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="GoodbyeService" targetNamespace="urn:samples-switchyard:dynamic-soap-endpoint:1.0"
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="urn:samples-switchyard:dynamic-soap-endpoint:1.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
    <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:samples-switchyard:dynamic-soap-endpoint:1.0"
      attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="urn:samples-switchyard:dynamic-soap-endpoint:1.0">
      <xsd:element name="goodbye" type="tns:goodbye" />
      <xsd:complexType name="goodbye">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="name" type="xsd:string" />
        </xsd:sequence>
      </xsd:complexType>
      <xsd:element name="goodbyeResponse" type="tns:goodbyeResponse" />
      <xsd:complexType name="goodbyeResponse">
        <xsd:sequence>
          <xsd:element minOccurs="0" name="message" type="xsd:string" />
        </xsd:sequence>
      </xsd:complexType>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="goodbye">
    <wsdl:part name="parameters" element="tns:goodbye" />
  </wsdl:message>
  <wsdl:message name="goodbyeResponse">
    <wsdl:part name="parameters" element="tns:goodbyeResponse" />
  </wsdl:message>
  <wsdl:portType name="GoodbyeServicePortType">
    <wsdl:operation name="goodbye">
      <wsdl:input name="goodbye" message="tns:goodbye" />
      <wsdl:output name="goodbyeResponse" message="tns:goodbyeResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="GoodbyeServiceSoapBinding" type="tns:GoodbyeServicePortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="goodbye">
      <soap:operation soapAction="goodbye" style="document" />
      <wsdl:input name="goodbye">
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output name="goodbyeResponse">
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="GoodbyeService">
    <wsdl:port name="GoodbyeServicePort" binding="tns:GoodbyeServiceSoapBinding">
      <soap:address location="http://localhost:8080/sample/GoodbyeService" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
