dynamic-soap-endpoint/src/test/resources/xml/request-goodbye.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sample="urn:samples-switchyard:dynamic-soap-endpoint:1.0">
  <soapenv:Header />
  <soapenv:Body>
    <sample:goodbye>
      <sample:name>Test</sample:name>
    </sample:goodbye>
  </soapenv:Body>
</soapenv:Envelope>